Revit 2027 API
BuiltInFailures.FaceSplitterFailures.NoFaceForSplit Property
 The highlighted element no longer contains a face that has been split by highlighted sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFaceForSplit { get; }
Public Shared ReadOnly Property NoFaceForSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFaceForSplit {
	FailureDefinitionId^ get ();
}
static member NoFaceForSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace